nvitya/vihal/armm/STM32/src/hwclk_stm32.cpp
/* This file is a part of the VIHAL project: https://github.com/nvitya/vihal
 * Copyright (c) 2021 Viktor Nagy, nvitya
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 * --------------------------------------------------------------------------- */
/*
 *  file:     hwclk_stm32.cpp
 *  brief:    STM32 clock speed implementation
 *  date:     2021-10-23
 *  authors:  nvitya
*/

#include "platform.h"
#include "hwclk.h"

void hwclk_start_ext_osc(unsigned aextspeed)
{
  uint32_t crreg = RCC->CR;
#ifdef RCC_CR_HSEBYP
  if (aextspeed & HWCLK_EXTCLK_BYPASS)
  {
    crreg |= RCC_CR_HSEBYP;
    RCC->CR = crreg;
  }
#endif
  crreg |= RCC_CR_HSEON;
  RCC->CR = crreg;

  while (0 == (RCC->CR & RCC_CR_HSERDY))
  {
    // wait
  }
}

static bool is_divisible(unsigned nom, unsigned div)
{
  unsigned res = nom / div;
  return (res * div == nom);
}

#if !defined(RCC_CFGR_PLLMUL) && defined(RCC_CFGR_PLLMULL)
  #define RCC_CFGR_PLLMUL RCC_CFGR_PLLMULL
#endif

#if defined(MCUSF_F0) || defined(MCUSF_L0)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  /* Enable Prefetch Buffer and set Flash Latency */
#ifdef FLASH_ACR_PRFTBE
  FLASH->ACR = FLASH_ACR_PRFTBE | FLASH_ACR_LATENCY;
#else
  FLASH->ACR = FLASH_ACR_LATENCY | FLASH_ACR_PRFTEN;
#endif
}

#elif defined(MCUSF_F1) || defined(MCUSF_F3)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  RCC->APB1ENR |= RCC_APB1ENR_PWREN;  // Enable Power Control clock

  /* Enable Prefetch Buffer */
  FLASH->ACR |= FLASH_ACR_PRFTBE;

  unsigned ws;
  if (acpuspeed <= 24000000)
  {
    ws = FLASH_ACR_LATENCY_0;
  }
  else if (acpuspeed <= 48000000)
  {
    ws = FLASH_ACR_LATENCY_1;
  }
  else
  {
    ws = FLASH_ACR_LATENCY_2;
  }

  FLASH->ACR &= ~FLASH_ACR_LATENCY;
  FLASH->ACR |= ws;

  //FLASH->ACR |= (1 << 3);
}

#elif defined(MCUSF_F4)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  RCC->APB1ENR |= RCC_APB1ENR_PWREN;  // Enable Power Control clock

  // set voltage scaling for maximal speed
#if defined(PWR_CR_ODEN)

  // enabling overdrive
  PWR->CR |= PWR_CR_ODEN;
  while (!(PWR->CSR & PWR_CSR_ODRDY)) { }  // wait for status flag

  PWR->CR |= PWR_CR_ODSWEN;
  while (!(PWR->CSR & PWR_CSR_ODSWRDY)) { }  // wait for status flag

  PWR->CR |= PWR_CR_VOS; // set voltage scaling

#else
  PWR->CR |= PWR_CR_VOS; // set voltage scaling
#endif

  // set Flash latency
  FLASH->ACR &= ~FLASH_ACR_LATENCY;
  FLASH->ACR |= FLASH_ACR_LATENCY_5WS;

  // enable caches and prefetch
  FLASH->ACR |= (FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_PRFTEN);
}

#elif defined(MCUSF_G4)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  unsigned tmp;

  RCC->APB1ENR1 |= RCC_APB1ENR1_PWREN;  // Enable Power Control clock

  if (acpuspeed > 150000000)  // 1.28 V (Boost) required for the core
  {
    PWR->CR5 &= ~PWR_CR5_R1MODE;  // Enable boost
  }
  else // 1.2 V required for the Core (1.0 V not supported (up to 26 MHz))
  {
    PWR->CR5 |= PWR_CR5_R1MODE;   // Disable boost
  }

  // Set Voltage Scaling Range 1 (normal mode), (1.0 V mode (up to 26 MHz) not supported)

  tmp = PWR->CR1;
  tmp &= ~(PWR_CR1_VOS);
  tmp |= PWR_CR1_VOS_0;
  PWR->CR1 = tmp;
  while (PWR->SR2 & PWR_SR2_VOSF)
  {
    // Wait until VOSF is cleared
  }

  // set Flash latency

  unsigned ws;
  if      (acpuspeed <=  60000000)  ws = FLASH_ACR_LATENCY_2WS;  // this is the safest minimum that works always, not the fastest one
  else if (acpuspeed <=  80000000)  ws = FLASH_ACR_LATENCY_3WS;
  else if (acpuspeed <= 100000000)  ws = FLASH_ACR_LATENCY_4WS;
  else if (acpuspeed <= 120000000)  ws = FLASH_ACR_LATENCY_5WS;
  else if (acpuspeed <= 140000000)  ws = FLASH_ACR_LATENCY_6WS;
  else if (acpuspeed <= 160000000)  ws = FLASH_ACR_LATENCY_7WS;
  else
  {
    ws = FLASH_ACR_LATENCY_8WS;
  }

  FLASH->ACR &= ~FLASH_ACR_LATENCY;
  FLASH->ACR |= ws;

  // enable caches and prefetch
  FLASH->ACR |= (FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_PRFTEN);
}

#elif defined(MCUSF_WB)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  unsigned tmp;

  // Set Voltage Scaling Range 1 (normal mode), (Range 2 (up to 16 MHz) not supported)

  tmp = PWR->CR1;
  tmp &= ~(PWR_CR1_VOS);
  tmp |= PWR_CR1_VOS_0;  // VOS_0 = Range 1, VOS_1 = Range 2
  PWR->CR1 = tmp;
  while (PWR->SR2 & PWR_SR2_VOSF)
  {
    // Wait until VOSF is cleared
  }

  // set Flash latency

  unsigned ws;
  if      (acpuspeed <= 18000000)  ws = FLASH_ACR_LATENCY_0WS;
  else if (acpuspeed <= 36000000)  ws = FLASH_ACR_LATENCY_1WS;
  else if (acpuspeed <= 54000000)  ws = FLASH_ACR_LATENCY_2WS;
  else
  {
    ws = FLASH_ACR_LATENCY_3WS;
  }

  tmp = FLASH->ACR;
  tmp &= ~FLASH_ACR_LATENCY;
  tmp |= ws;
  FLASH->ACR = ws;

  // enable caches and prefetch
  FLASH->ACR |= (FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_PRFTEN);
}

#elif defined(MCUSF_F7)

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  RCC->APB1ENR |= RCC_APB1ENR_PWREN;  // Enable Power Control clock

  // The voltage scaling allows optimizing the power consumption when the
  // device is clocked below the maximum system frequency, to update the
  // voltage scaling value regarding system frequency refer to product
  // datasheet.

  // Enable the Over-drive to extend the clock frequency to 216 MHz
  PWR->CR1 |= PWR_CR1_ODEN;
  while((PWR->CSR1 & PWR_CSR1_ODRDY) == 0) { }

