nvitya/vihal/armm/STM32/src/hwclk_stm32.cpp
  // Enable the Over-drive switch
  PWR->CR1 |= (uint32_t)PWR_CR1_ODSWEN;
  while((PWR->CSR1 & PWR_CSR1_ODRDY) == 0) { }

  PWR->CR1 |= PWR_CR1_VOS;  // voltage scaling for maximum speed (Scale 1)

  // set Flash latency
  FLASH->ACR &= ~FLASH_ACR_LATENCY;
  FLASH->ACR |= FLASH_ACR_LATENCY_6WS;

  FLASH->ACR |= FLASH_ACR_ARTEN | FLASH_ACR_PRFTEN;  // turn on the ART accelerator
}

#elif defined(MCUSF_H7)

// && defined(SYSCFG_PWRCR_ODEN) /* STM32H74xxx and STM32H75xxx lines */

#ifndef MCUSF_H7_V2
  // STM32H74xxx and STM32H75xxx lines
  #define LL_PWR_REGU_VOLTAGE_SCALE0      (PWR_D3CR_VOS_0 | PWR_D3CR_VOS_1) /*!< Select voltage scale 0 */
#else
  // STM32H73xx and newer
  #define LL_PWR_REGU_VOLTAGE_SCALE0      0x00000000U                       /*!< Select voltage scale 0 */
#endif

void hwclk_prepare_hispeed(unsigned acpuspeed)
{
  uint32_t tmp;

  // set LDO
  tmp = PWR->CR3;
  tmp &= ~(PWR_CR3_SCUEN | PWR_CR3_LDOEN | PWR_CR3_BYPASS);
  tmp |= PWR_CR3_LDOEN;
  PWR->CR3 = tmp;

  while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) != PWR_CSR1_ACTVOSRDY)
  {
    // wait until ready....
  }

  tmp = PWR->D3CR;
  tmp &= ~PWR_D3CR_VOS_Msk;
  tmp |= (LL_PWR_REGU_VOLTAGE_SCALE0 << PWR_D3CR_VOS_Pos); // VOS0 (=Scale 3) required for maximal speed
  PWR->D3CR = tmp;

  if (PWR->D3CR) { } // some delay
  if (PWR->D3CR) { } // some delay

#ifndef MCUSF_H7_V2
  // Enable the PWR overdrive for the maximal speed
  SYSCFG->PWRCR |= SYSCFG_PWRCR_ODEN;
  if (SYSCFG->PWRCR) { } // some delay
  if (SYSCFG->PWRCR) { } // some delay
  if (SYSCFG->PWRCR) { } // some delay
#endif

  while (0 == (PWR->D3CR & PWR_D3CR_VOSRDY))
  {
    // wait until ready
  }

  // set Flash latency
  tmp = FLASH->ACR;
  tmp &= ~(FLASH_ACR_LATENCY | FLASH_ACR_WRHIGHFREQ);
#ifndef MCUSF_H7_V2
  tmp |= (FLASH_ACR_LATENCY_4WS | FLASH_ACR_WRHIGHFREQ_1);
#else
  tmp |= (FLASH_ACR_LATENCY_3WS | FLASH_ACR_WRHIGHFREQ_1 | FLASH_ACR_WRHIGHFREQ_0);
#endif
  FLASH->ACR = tmp;
}

#else
  #error "STM32 hi-speed setup missing for this subfamily"
#endif

//---------------------------------------------------------------------------------------------------------------------------
#if defined(MCUSF_F0) || defined(MCUSF_L0)
//---------------------------------------------------------------------------------------------------------------------------

bool hwclk_init(unsigned external_clock_hz, unsigned target_speed_hz)
{
  // select the HSI as clock source (required if this is called more times)

  uint32_t cfgr;

  cfgr = RCC->CFGR;
  cfgr &= ~3;
  cfgr |= RCC_CFGR_SW_HSI;
  RCC->CFGR = cfgr;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_HSI)
  {
    // wait until it is set
  }

  RCC->CR &= ~RCC_CR_PLLON;  // disable the PLL
  while ((RCC->CR & RCC_CR_PLLRDY) != 0)
  {
    // Wait until the PLL is ready
  }

  SystemCoreClock = MCU_INTERNAL_RC_SPEED; // set the global variable for the fall error happens

  hwclk_prepare_hispeed(target_speed_hz);

  unsigned basespeed;
  unsigned pllsrc;
  if (external_clock_hz)
  {
    hwclk_start_ext_osc(external_clock_hz);
    basespeed = (external_clock_hz & HWCLK_EXTCLK_MASK);
  }
  else
  {
    // the internal oscillator is usually 8 MHz, but it will be divided by 2 at the PLL input
    basespeed = (MCU_INTERNAL_RC_SPEED >> 1);
  }

  unsigned freqmul = target_speed_hz / basespeed;
  if ((freqmul < 2) or (freqmul > 16))
  {
    return false;
  }

  cfgr = RCC->CFGR;

#if defined(MCUSF_L0)

  // only a few combinations supported, but usually the max speed will be used.

  unsigned plldiv = 1;  // = 2, using this fix value
  unsigned pllmul = 0;
  switch (freqmul)
  {
    case  2:  pllmul = 1; break;
    case  3:  pllmul = 2; break;
    case  4:  pllmul = 3; break;
    case  6:  pllmul = 4; break;
    case  8:  pllmul = 5; break;
    case 12:  pllmul = 6; break;
    case 16:  pllmul = 7; break;
    case 24:  pllmul = 8; break;
    default:  pllmul = 0; break;
  }

  // do not divide the peripheral clocks:
  cfgr &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);

  /* PLL configuration = HSE * 6 = 48 MHz */
  cfgr &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLDIV | RCC_CFGR_PLLMUL));
  cfgr |= (uint32_t)((pllmul << 18) | (plldiv << 22));
  if (external_clock_hz)
  {
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSE);
  }

#else

  unsigned pllmul = ((freqmul - 2) & 0xF);  // STM32F0 multiplyer code

  // setup bus dividers AHB=1, PERIPH=1
  cfgr &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE);
  cfgr |= (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE_DIV1);

  cfgr &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMUL);
  cfgr |= (pllmul << 18);

  if (external_clock_hz)
  {
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSE_PREDIV | RCC_CFGR_PLLXTPRE_HSE_PREDIV_DIV1);
  }
  else
  {
#ifdef RCC_CFGR_PLLSRC_HSI_DIV2
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSI_DIV2);
#else
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSI_PREDIV);
#endif
  }

#endif

  RCC->CFGR = cfgr;

  RCC->CR |= RCC_CR_PLLON;  // enable the PLL
  while((RCC->CR & RCC_CR_PLLRDY) == 0)
  {
    // Wait till PLL is ready
  }

  // Select PLL as system clock source
  cfgr &= ~3;
  cfgr |= RCC_CFGR_SW_PLL;
  RCC->CFGR = cfgr;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_PLL)
  {
    // wait until it is set
  }

  SystemCoreClock = target_speed_hz;
  return true;
}

//---------------------------------------------------------------------------------------------------------------------------
#elif defined(MCUSF_F1) || defined(MCUSF_F3)
//---------------------------------------------------------------------------------------------------------------------------

bool hwclk_init(unsigned external_clock_hz, unsigned target_speed_hz)
{
  unsigned cfgr;

  // set back to the internal oscillator
  cfgr = RCC->CFGR;
  cfgr &= ~3;
  cfgr |= RCC_CFGR_SW_HSI;
  RCC->CFGR = cfgr;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_HSI)
  {
    // wait until it is set
  }

  RCC->CR &= ~RCC_CR_PLLON;  // disable the PLL
  while ((RCC->CR & RCC_CR_PLLRDY) != 0)
  {
    // Wait till the PLL is not ready
  }

  SystemCoreClock = MCU_INTERNAL_RC_SPEED; // set the global variable for the fall error happens

