nvitya/vihal/armm/STM32/src/hwclk_stm32.cpp
  hwclk_prepare_hispeed(target_speed_hz);

  unsigned basespeed;
  if (external_clock_hz)
  {
    hwclk_start_ext_osc(external_clock_hz);
    basespeed = (external_clock_hz & HWCLK_EXTCLK_MASK);
  }
  else
  {
    basespeed = MCU_INTERNAL_RC_SPEED;
  }

  unsigned freqmul = target_speed_hz / basespeed;
  if ((freqmul < 2) or (freqmul > 16))
  {
    return false;
  }

  cfgr = RCC->CFGR;

  // setup bus divisors

  cfgr &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);
  cfgr |= RCC_CFGR_HPRE_DIV1;   // HCLK = SYSCLK
  cfgr |= RCC_CFGR_PPRE2_DIV1;  // PCLK2 = HCLK
  cfgr |= RCC_CFGR_PPRE1_DIV2;  // PCLK1 = HCLK / 2

  // setup PLL

  cfgr &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE |  RCC_CFGR_PLLMUL);

#if defined(MCUSF_F1)

  if (external_clock_hz)
  {
    unsigned pllmul = ((freqmul - 2) & 0xF);  // STM32F1 multiplyer code
    cfgr |= (RCC_CFGR_PLLSRC | (pllmul << 18));
  }
  else
  {
    // src bit cleared = HSI / 2 is the clock source for PLL
    // With internal RC clock the maximal speed is 64 MHz !!!
    unsigned pllmul = ((freqmul*2 - 2) & 0xF);
    cfgr |= (pllmul << 18);
  }

#elif defined(MCUSF_F3)

  if (external_clock_hz)
  {
    // no prediv
    unsigned pllmul = ((freqmul - 2) & 0xF);  // STM32F3 multiplyer code
    cfgr |= (uint32_t)(pllmul << 18);
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSE_PREDIV | RCC_CFGR_PLLXTPRE_HSE_PREDIV_DIV1);
  }
  else
  {
    // With internal RC clock the maximal speed is 64 MHz !!!
    // we have a /2 division
    unsigned pllmul = freqmul*2;
    if (pllmul >= 16)
    {
      pllmul = 15;
    }
    else
    {
      pllmul -= 2;
    }
    cfgr |= (uint32_t)(pllmul << 18);
    cfgr |= (uint32_t)(RCC_CFGR_PLLSRC_HSI_DIV2);
  }

#endif

  RCC->CFGR = cfgr;

  RCC->CR |= RCC_CR_PLLON;  // Enable PLL
  while ((RCC->CR & RCC_CR_PLLRDY) == 0)
  {
    // Wait until the PLL is ready
  }

  cfgr &= ~(RCC_CFGR_SW);
  cfgr |= RCC_CFGR_SW_PLL;  // Select the PLL as the system clock source
  RCC->CFGR = cfgr;

  while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
  {
    // Wait until the PLL is used as the system clock source
  }

#if defined(RCC_APB2ENR_SYSCFGEN)
  RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;
#endif

  SystemCoreClock = target_speed_hz;
  return true;
}

//---------------------------------------------------------------------------------------------------------------------------
#elif defined(MCUSF_G4) || defined(MCUSF_WB)
//---------------------------------------------------------------------------------------------------------------------------

#ifndef RCC_CFGR_SW_PLL  // MCUSF_WB has no such define
  #define RCC_CFGR_SW_PLL  3
#endif

bool hwclk_init(unsigned external_clock_hz, unsigned target_speed_hz)
{
  uint32_t tmp;

  // set back to the internal oscillator
  #if defined(MCUSF_WB)

    // for the WB the MSI will be selected as it is the default source after the reset

    // ensure that the MSI is running at 4 MHz
    tmp = RCC->CR;
    tmp &= ~(RCC_CR_MSIRANGE);
    tmp |= RCC_CR_MSIRANGE_6; // range6 = 4 MHz
    tmp |= RCC_CR_MSION;
    RCC->CR = tmp;
    while (0 == (RCC->CR & RCC_CR_MSIRDY))
    {
      // wait until it is ready
    }

    // select the MSI as the clock source
    #if !defined(RCC_CFGR_SW_MSI)
      #define RCC_CFGR_SW_MSI 0
    #endif
    tmp = RCC->CFGR;
    tmp &= ~3;
    tmp |= RCC_CFGR_SW_MSI;
    RCC->CFGR = tmp;
    while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_MSI)
    {
      // wait until it is set
    }
  #else
    tmp = RCC->CFGR;
    tmp &= ~3;
    tmp |= RCC_CFGR_SW_HSI;
    RCC->CFGR = tmp;
    while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_HSI)
    {
      // wait until it is set
    }
  #endif

  RCC->CR &= ~RCC_CR_PLLON;  // disable the PLL
  while ((RCC->CR & RCC_CR_PLLRDY) != 0)
  {
    // Wait until the PLL is ready
  }

  SystemCoreClock = MCU_INTERNAL_RC_SPEED; // set the global variable for the fall error happens

  hwclk_prepare_hispeed(target_speed_hz);

  unsigned basespeed;
  unsigned pllsrc;
  if (external_clock_hz)
  {
    hwclk_start_ext_osc(external_clock_hz);
    basespeed = (external_clock_hz & HWCLK_EXTCLK_MASK);
    pllsrc = 3;  // HSE
  }
  else
  {
    #if defined(MCUSF_WB)  // start the HSI
      RCC->CR |= RCC_CR_HSION;
      while (0 == (RCC->CR & RCC_CR_HSIRDY))
      {
        // wait until it is ready
      }
    #endif

    pllsrc = 2; // HSI (16 MHz)
    basespeed = MCU_INTERNAL_RC_SPEED;
  }

  unsigned vcospeed = target_speed_hz * 2;
  unsigned pllp = 2; // divide by 2 to get the final CPU speed

  // try some round frequencies for VCO input:
  unsigned vco_in_hz;
  vco_in_hz = 4000000; // this is the default
  if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
  {
    vco_in_hz = 5000000; // for 25 MHz input cristals
    if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
    {
      vco_in_hz = 3000000;
      if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
      {
        vco_in_hz = 4000000;  // not synthetizable properly, stay with the default
      }
    }
  }

  unsigned pllm = basespeed / vco_in_hz;
  unsigned plln = vcospeed / vco_in_hz;

  if (pllm > 1)  --pllm;

  #if defined(MCUSF_WB)  // the register layout is different
    RCC->PLLCFGR = 0
      | (pllsrc <<  0)  // PLLSRC(2)
      | (pllm   <<  4)  // PLLM(4)
      | (plln   <<  8)  // PLLN(7)
      | (1      << 16)  // PLLPEN
      | (1      << 17)  // PLLP(5): 1 = VCO / 2, same as PCLK
      | (1      << 24)  // PLLQEN
      | (1      << 25)  // PLLQ(3): 1 = VCO / 2, same as PCLK
      | (1      << 28)  // PLLREN
      | (1      << 29)  // PLLR(3): system clock = VCO speed / 2
    ;
  #else
    RCC->PLLCFGR = 0
      | (pllsrc <<  0)  // PLLSRC(2)
      | (pllm   <<  4)  // PLLM(4)
      | (plln   <<  8)  // PLLN(7)
      | (1      << 16)  // PLLPEN
      | (0      << 17)  // PLLP: 0 = use PLLPDIV
      | (1      << 20)  // PLLQEN
      | (2      << 21)  // PLLQ(2): divide by 6, this gives only 48 MHz at 144 MHz CPU speed
      | (1      << 24)  // PLLREN
      | (0      << 25)  // PLLR(2): system clock = VCO speed / 2
      | (2      << 27)  // PLLPDIV(5): divide by 2
    ;
  #endif

