nvitya/vihal/armm/STM32/src/hwclk_stm32.cpp
  RCC->CR |= RCC_CR_PLLON;  // enable the PLL
  while((RCC->CR & RCC_CR_PLLRDY) == 0)
  {
    // Wait till PLL is ready
  }

  #if defined(MCUSF_G4)

    // on the G4 devices the APB1 and APB2 buses allowed to run with system clock speed
    // select bus dividers AHB=1, ABP1=1, APB2=1
    tmp = RCC->CFGR;
    tmp &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);
    tmp |= (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV1 | RCC_CFGR_PPRE2_DIV1);
    RCC->CFGR = tmp;

  #elif defined(MCUSF_WB)

    // select bus dividers AHB=1, ABP1=1, APB2=1 (no divisions required)
    tmp = RCC->CFGR;
    tmp &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2); // clearing all these means do not divide
    RCC->CFGR = tmp;

    tmp = RCC->EXTCFGR;
    tmp &= ~(RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_SHDHPRE);
    //tmp |= (8 << RCC_EXTCFGR_C2HPRE_Pos);  // HCLK2: 8 = divide by 2
    RCC->EXTCFGR = tmp;

    // divide clock for CPU2 (cortex M0+) and SRAM2 by 2 if the sysclk is greater than 32Mhz
    if(target_speed_hz > 32000000)
    {
		tmp = RCC->EXTCFGR;
		tmp &= ~(RCC_EXTCFGR_C2HPRE | RCC_EXTCFGR_SHDHPRE);
		tmp |= (8 << RCC_EXTCFGR_C2HPRE_Pos) | (8 << RCC_EXTCFGR_SHDHPRE_Pos);  // HCLK2: 8 = divide by 2
		RCC->EXTCFGR = tmp;
    }

    // select for USART sysclk as clock source
    tmp = RCC->CCIPR;
    tmp &= ~(RCC_CCIPR_USART1SEL_Msk);
    tmp |= (1 << RCC_CCIPR_USART1SEL_Pos);  // Select Sysclk
    RCC->CCIPR = tmp;

  #else
    #error "Unimplemented sub-family handling here"
  #endif

  // Select PLL as system clock source

  tmp &= ~3;
  tmp |= RCC_CFGR_SW_PLL;
  RCC->CFGR = tmp;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_PLL)
  {
    // wait until it is set
  }

  SystemCoreClock = target_speed_hz;
  return true;
}

//---------------------------------------------------------------------------------------------------------------------------
#elif defined(MCUSF_F4) || defined(MCUSF_F7)
//---------------------------------------------------------------------------------------------------------------------------

bool hwclk_init(unsigned external_clock_hz, unsigned target_speed_hz)
{
  // select the HSI as clock source (required if this is called more times)

  uint32_t tmp;

  tmp = RCC->CFGR;
  tmp &= ~3;
  tmp |= RCC_CFGR_SW_HSI;
  RCC->CFGR = tmp;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_HSI)
  {
    // wait until it is set
  }

  RCC->CR &= ~RCC_CR_PLLON;  // disable the PLL
  while ((RCC->CR & RCC_CR_PLLRDY) != 0)
  {
    // Wait until the PLL is ready
  }

  SystemCoreClock = MCU_INTERNAL_RC_SPEED; // set the global variable for the fall error happens

  if (target_speed_hz < 24000000) // minimum speed to use the PLL
  {
    return (target_speed_hz == MCU_INTERNAL_RC_SPEED);
  }

  hwclk_prepare_hispeed(target_speed_hz);

  unsigned basespeed;
  unsigned pllsrc;
  if (external_clock_hz)
  {
    hwclk_start_ext_osc(external_clock_hz);
    basespeed = (external_clock_hz & HWCLK_EXTCLK_MASK);
    pllsrc = 1;
  }
  else
  {
    pllsrc = 0;
    basespeed = MCU_INTERNAL_RC_SPEED;
  }


  unsigned pllp = 2; // divide by 2 to get the final CPU speed
  unsigned vcospeed = target_speed_hz * pllp;

  // use the minimal VCO speed
  while (vcospeed < 192000000)
  {
    pllp += 2;
    vcospeed = target_speed_hz * pllp;
  }

  // try to find a speed for the USB
  while (!is_divisible(vcospeed, 48000000) && (target_speed_hz * (pllp + 2) <= 432000000))
  {
    pllp += 2;
    vcospeed = target_speed_hz * pllp;
  }

  unsigned pll_input_freq = 2000000;
  if ((external_clock_hz / 1000000) & 1)  // is the input MHz divisible by 2 ?
  {
    pll_input_freq = 1000000;
  }
  unsigned pllm = basespeed / pll_input_freq;   // generate 1-2 MHz VCO input
  unsigned plln = vcospeed  / pll_input_freq;   // the vco multiplier
  unsigned pllq = vcospeed / 48000000;          // usb speed

  RCC->PLLCFGR =
      (pllsrc << 22)  // select PLL source
    | (pllm <<  0)
    | (plln <<  6)
    | (((pllp >> 1) - 1) << 16)
    | (pllq << 24)
  ;

  RCC->CR |= RCC_CR_PLLON;  // enable the PLL
  while((RCC->CR & RCC_CR_PLLRDY) == 0)
  {
    // Wait till PLL is ready
  }

  // select bus dividers AHB=1, ABP1=4, APB2=2
  tmp = RCC->CFGR;
  tmp &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);
  tmp |= (RCC_CFGR_HPRE_DIV1 | RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2);
  RCC->CFGR = tmp;

  // Select PLL as system clock source

  tmp &= ~3;
  tmp |= RCC_CFGR_SW_PLL;
  RCC->CFGR = tmp;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_PLL)
  {
    // wait until it is set
  }

#ifdef MCUSF_F7
  RCC->DCKCFGR2 &= ~(RCC_DCKCFGR2_CK48MSEL); // select the 48 MHz from the PLL
#endif

  SystemCoreClock = target_speed_hz;
  return true;
}

//---------------------------------------------------------------------------------------------------------------------------
#elif defined(MCUSF_H7)
//---------------------------------------------------------------------------------------------------------------------------

bool hwclk_init(unsigned external_clock_hz, unsigned target_speed_hz)
{
  uint32_t tmp;

  // select the HSI as clock source (required if this is called more times)
  tmp = RCC->CFGR;
  tmp &= ~3;
  tmp |= RCC_CFGR_SW_HSI;
  RCC->CFGR = tmp;
  while (((RCC->CFGR >> 2) & 3) != RCC_CFGR_SW_HSI)
  {
    // wait until it is set
  }

  RCC->CR &= ~RCC_CR_PLLON;  // disable the PLL
  while ((RCC->CR & RCC_CR_PLLRDY) != 0)
  {
    // Wait until the PLL is ready
  }

  SystemCoreClock = MCU_INTERNAL_RC_SPEED; // set the global variable for the fall error happens

  hwclk_prepare_hispeed(target_speed_hz);

  unsigned basespeed;
  unsigned pllsrc;
  if (external_clock_hz)
  {
    hwclk_start_ext_osc(external_clock_hz);
    basespeed = (external_clock_hz & HWCLK_EXTCLK_MASK);
    pllsrc = RCC_PLLCKSELR_PLLSRC_HSE;
  }
  else
  {
    pllsrc = RCC_PLLCKSELR_PLLSRC_HSI;
    basespeed = MCU_INTERNAL_RC_SPEED;
  }

  unsigned vcospeed = target_speed_hz;  // no * 2 here like by the other models !

  // try some round frequencies for VCO input:
  unsigned pllrange;
  unsigned vco_in_hz;
  vco_in_hz = 8000000; // this provides lower jitter
  pllrange = 3;
  if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
  {
    vco_in_hz = 5000000; // for 25 MHz input cristals
    pllrange = 2;
    if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
    {
      vco_in_hz = 4000000; // try this one then
      pllrange = 2;
      if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
      {
        vco_in_hz = 3000000;
        pllrange = 1;
        if (!is_divisible(basespeed, vco_in_hz) || !is_divisible(vcospeed, vco_in_hz))
        {
          vco_in_hz = 2000000;  // hoping that works, 2MHz is the minimal PLL input freq.
          pllrange = 0;
        }
      }
    }
  }

  unsigned pllm = basespeed / vco_in_hz;   // vco input pre-divider

  unsigned plln = vcospeed  / vco_in_hz;   // the vco multiplier
  unsigned pllq = vcospeed / 48000000;     // usb speed
  unsigned pllp = 1;  // no processor division
  unsigned pllr = 2;

