nvitya/vihal/armm/STM32/src/hwclk_stm32.cpp
  tmp = RCC->PLLCFGR;
  tmp &= ~((0xF << 0) | (7 << 16)); // clear PLL1 configuration
  tmp |= (0
    | (7 << 16) // enable all outputs (P, Q, R)
    | (pllrange <<  2) // PLLRGE(2): 0 = 1-2 MHz PLL1 input clock range
    | (0 <<  1) // PLL1VCOSEL: 0 = wide range (192-836 MHz), 1 = medium range (150 - 420 MHz)
    | (0 <<  0) // PLL1FRACEN: 0 = disable fractional divider
  );
  RCC->PLLCFGR = tmp;

  tmp = RCC->PLLCKSELR;
  tmp &= ~(RCC_PLLCKSELR_PLLSRC | RCC_PLLCKSELR_DIVM1);
  tmp |= (0
         | (pllsrc   << RCC_PLLCKSELR_PLLSRC_Pos)
         | (pllm     << RCC_PLLCKSELR_DIVM1_Pos)
  );
  RCC->PLLCKSELR = tmp;

  // configure PLL1 dividers:
  RCC->PLL1DIVR = (0
    | ((plln - 1) << RCC_PLL1DIVR_N1_Pos)
    | ((pllp - 1) << RCC_PLL1DIVR_P1_Pos)
    | ((pllq - 1) << RCC_PLL1DIVR_Q1_Pos)
    | ((pllr - 1) << RCC_PLL1DIVR_R1_Pos)
  );

  RCC->CR |= RCC_CR_PLLON;  // enable the PLL
  while((RCC->CR & RCC_CR_PLLRDY) == 0)
  {
    // Wait till PLL is ready
  }

#ifndef MCUSF_H7_V2  // at the H74x, H75x all the APB buses can run at 200 MHz

  // set CPU divider to 1, and all bus dividers to 2:

  unsigned ahbdiv = 8;
  unsigned apbdiv = 0;  // 0 = same as the AHB bus speed
  if (target_speed_hz <= MAX_CLOCK_SPEED / 2)
  {
    // no bus speed division required.
    ahbdiv = 0;
  }

#else  // newer models, where the APB buses limited to 137.5 MHz

  unsigned ahbdiv = 8;
  unsigned apbdiv = 4;  // 4 = /2 of the AHB
  if (target_speed_hz <= MAX_CLOCK_SPEED / 2)
  {
    // no bus speed division required.
    ahbdiv = 0;
    if (target_speed_hz <= MAX_CLOCK_SPEED / 4)
    {
      apbdiv = 0;
    }
  }

#endif

  RCC->D1CFGR = (0
    | (0       <<  8)  // D1CPRE(4): CPU clock division, 0 = not divided
    | (apbdiv  <<  4)  // D1PPRE(3): APB3 division, 4 = divided by 2
    | (ahbdiv  <<  0)  // HPRE(4):   AHB division, 8 = divided by 2
  );

  RCC->D2CFGR = (0
    | (apbdiv <<  8)  // D2PPRE2(3): APB2 division, 4 = divided by 2
    | (apbdiv <<  4)  // D2PPRE1(3): APB1 division, 4 = divided by 2
  );

  RCC->D3CFGR = (0
    | (apbdiv <<  4)  // D2PPRE1(3): APB4 division, 4 = divided by 2
  );

  // Select PLL as system clock source

  tmp = RCC->CFGR;
  tmp &= ~RCC_CFGR_SW;
  tmp |= RCC_CFGR_SW_PLL1;
  RCC->CFGR = tmp;
  while (((RCC->CFGR & RCC_CFGR_SWS_Msk) >> RCC_CFGR_SWS_Pos) != RCC_CFGR_SW_PLL1)
  {
    // wait until it is set
  }

  // USB !
  //RCC->DCKCFGR2 &= ~(RCC_DCKCFGR2_CK48MSEL); // select the 48 MHz from the PLL

  SystemCoreClock = target_speed_hz;
  return true;
}

#else
  #error "STM32 MCU Clock Setup not implemented for this sub-family"
#endif

